fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеРаботы/ВКМ_ВыполненныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставлена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <comment>Дата начала  абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <comment>Дата окончания абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Стоимость часа работы специалиста</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение  Тогда

#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьТаблицуМассовоСозданныхРеализацийСервер(ЗаМесяц, Организация) Экспорт  
	
	Замедлить = Ложь; //Переменная для включения искуственного замедления  для тестирования длительных операций
	
	МассивДоговоровИРеализаций = Новый Массив;
	
	//2. Для каждого договора создаем (или изменяем) документ Реализация. Дата документа - последний день месяца
	Договоры = ЗапросДоговоровЗаМесяц(ЗаМесяц, Организация);
	
	КолвоДоговоров = Договоры.Количество(); 
	ОбработаноДоговоров = 0;
	  
	Пока Договоры.Следующий() Цикл
		ОписаниеДокумента = Новый Структура;  
		ОписаниеДокумента.Вставить("Контрагент", Договоры.Контрагент);
		ОписаниеДокумента.Вставить("Договор", Договоры.Договор);  
		ОписаниеДокумента.Вставить("Дата", КонецМесяца(ЗаМесяц));
		ОписаниеДокумента.Вставить("Организация", Организация);
		
		Если НЕ ЗначениеЗаполнено(Договоры.РеализацияСсылка) Тогда  
			//Создаем новый документ
			Комментарий = СтрШаблон("Создан обработкой ""Массовое создание актов"" %1", ТекущаяДатаСеанса());			
			ОписаниеДокумента.Вставить("Комментарий", Комментарий);			
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			
		Иначе  
			//Если документ уже есть перезаписываем его
			Комментарий = СтрШаблон("Изменен обработкой ""Массовое создание актов"" %1", ТекущаяДатаСеанса());
			ОписаниеДокумента.Вставить("Комментарий", Комментарий);			
			
			ДокументОбъект = Договоры.РеализацияСсылка.ПолучитьОбъект(); 
			
        КонецЕсли;
		    
		    ЗаполнитьДокументРеализация(ДокументОбъект, ОписаниеДокумента);			
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		    
		    ОписаниеДокумента.Вставить("ДокументРеализация", ДокументОбъект.Ссылка); 
		    МассивДоговоровИРеализаций.Добавить(ОписаниеДокумента);
		
		//-- Замедление для тестирования длительной процедуры--
		Если Замедлить Тогда
			ИскусственноеЗамедление(4); //Параметр - время паузы в секундах на обработку одного  договора
		КонецЕсли;	
		//-----

		ОбработаноДоговоров = ОбработаноДоговоров +1;
		ДлительныеОперации.СообщитьПрогресс(ОбработаноДоговоров*100/КолвоДоговоров);		
	КонецЦикла;	
		
	Возврат МассивДоговоровИРеализаций;
КонецФункции	
#КонецОбласти


 #Область СлужебныеПроцедурыИФункции
 
Функция ЗапросДоговоровЗаМесяц(ЗаМесяц, Организация)  	
	Запрос = Новый Запрос;   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
	               |ПОМЕСТИТЬ ВТ_Договора
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	(ДоговорыКонтрагентов.ВКМ_НачалоДействия <= &НачалоПериода
	               |				И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия >= &КонецПериода
	               |			ИЛИ ДоговорыКонтрагентов.ВКМ_НачалоДействия > &НачалоПериода
	               |				И ДоговорыКонтрагентов.ВКМ_НачалоДействия < &КонецПериода
	               |			ИЛИ ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия < &КонецПериода
	               |				И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия > &НачалоПериода)
	               |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Договора.Контрагент КАК Контрагент,
	               |	ВТ_Договора.Договор КАК Договор,
	               |	ВТ_Договора.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ВТ_Договора.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	               |	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка
	               |ПОМЕСТИТЬ ВТ_ДоговорИРеализация
	               |ИЗ
	               |	ВТ_Договора КАК ВТ_Договора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ВТ_Договора.Договор = РеализацияТоваровУслуг.Договор
	               |			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |			И (РеализацияТоваровУслуг.Проведен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоговорИРеализация.Контрагент КАК Контрагент,
	               |	ВТ_ДоговорИРеализация.Договор КАК Договор,
	               |	ВТ_ДоговорИРеализация.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ВТ_ДоговорИРеализация.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	               |	ЕСТЬNULL(ВТ_ДоговорИРеализация.РеализацияСсылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК РеализацияСсылка,
	               |	ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.КоличествоЧасовОборот, 0) КАК КоличествоЧасов,
	               |	ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
	               |ИЗ
	               |	ВТ_ДоговорИРеализация КАК ВТ_ДоговорИРеализация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеРаботыОбороты
	               |		ПО (ВКМ_ВыполненныеРаботыОбороты.Договор = ВТ_ДоговорИРеализация.Договор)";
	
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(ЗаМесяц));
	Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(ЗаМесяц));   
	Запрос.Параметры.Вставить("Организация", Организация);   
	Запрос.Параметры.Вставить("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка;
КонецФункции

Процедура ЗаполнитьДокументРеализация(ДокументОбъект, ОписаниеДокумента)
	
	ДокументОбъект.Заполнить(ОписаниеДокумента); 
	ДокументОбъект.ВыполнитьАвтозаполнение(ОписаниеДокумента.Договор);
	ДокументОбъект.ПроверитьЗаполнение();
	
КонецПроцедуры	

Процедура ИскусственноеЗамедление(Пауза)
	
	Для счетчик = 1 по Пауза Цикл 
		ВремяПаузы = ТекущаяДатаСеанса()+1;
		Пока ТекущаяДатаСеанса() <= ВремяПаузы Цикл
			
		КонецЦикла;	 
	КонецЦикла;	 
	   
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
